from __future__ import annotations

from typing import Any, Dict, List, Tuple

from sqlalchemy import func, select

from app.core.db import SessionLocal
from app.models.task import Task


TASKS: List[Dict[str, Any]] = [
    {
        "title": "2 + 2",
        "statement": "Сколько будет 2 + 2? Введите одно целое число.",
        "subject": "Математика",
        "topic": "Арифметика",
        "difficulty": 1,
        "answer_type": "int",
        "correct_answer": "4",
        "hints": ["Сложите два числа."],
    },
    {
        "title": "Столица Франции",
        "statement": "Введите столицу Франции (одно слово).",
        "subject": "Общее",
        "topic": "Факты",
        "difficulty": 1,
        "answer_type": "text",
        "correct_answer": "Париж",
        "hints": ["Подсказка: Эйфелева башня."],
    },
    {
        "title": "Последняя цифра 7^2025",
        "statement": "Найдите последнюю цифру числа 7^2025.",
        "subject": "Математика",
        "topic": "Теория чисел",
        "difficulty": 3,
        "answer_type": "int",
        "correct_answer": "7",
        "hints": ["Последние цифры степеней 7 образуют цикл длины 4."],
    },
    {
        "title": "Сумма нечётных до 199",
        "statement": "Найдите сумму всех нечётных чисел от 1 до 199 включительно.",
        "subject": "Математика",
        "topic": "Последовательности",
        "difficulty": 2,
        "answer_type": "int",
        "correct_answer": "10000",
        "hints": ["Это сумма первых 100 нечётных чисел."],
    },
    {
        "title": "Нули в конце 100!",
        "statement": "Сколько нулей в конце числа 100! ?",
        "subject": "Математика",
        "topic": "Комбинаторика",
        "difficulty": 4,
        "answer_type": "int",
        "correct_answer": "24",
        "hints": ["Посчитайте количество множителей 5 в разложении 100!."],
    },
    {
        "title": "Диагонали 20-угольника",
        "statement": "Сколько диагоналей у выпуклого 20-угольника?",
        "subject": "Математика",
        "topic": "Геометрия",
        "difficulty": 3,
        "answer_type": "int",
        "correct_answer": "170",
        "hints": ["Используйте формулу n(n-3)/2."],
    },
    {
        "title": "Площадь треугольника 13-14-15",
        "statement": "Найдите площадь треугольника со сторонами 13, 14 и 15.",
        "subject": "Математика",
        "topic": "Геометрия",
        "difficulty": 5,
        "answer_type": "int",
        "correct_answer": "84",
        "hints": ["Подходит формула Герона."],
    },
    {
        "title": "НОД и НОК",
        "statement": "Для двух чисел НОД = 6, НОК = 180. Одно число равно 30. Найдите второе.",
        "subject": "Математика",
        "topic": "Теория чисел",
        "difficulty": 4,
        "answer_type": "int",
        "correct_answer": "36",
        "hints": ["Используйте связь a*b = НОД*НОК."],
    },
    {
        "title": "Остаток 2^100 по модулю 7",
        "statement": "Найдите остаток от деления 2^100 на 7.",
        "subject": "Математика",
        "topic": "Теория чисел",
        "difficulty": 3,
        "answer_type": "int",
        "correct_answer": "2",
        "hints": ["Степени двойки по модулю 7 периодичны."],
    },
    {
        "title": "Остаток 3^57 по модулю 10",
        "statement": "Найдите последнюю цифру числа 3^57.",
        "subject": "Математика",
        "topic": "Теория чисел",
        "difficulty": 3,
        "answer_type": "int",
        "correct_answer": "3",
        "hints": ["Последние цифры степеней 3 образуют цикл длины 4."],
    },
    {
        "title": "C(8,3)",
        "statement": "Сколькими способами можно выбрать 3 человека из 8?",
        "subject": "Математика",
        "topic": "Комбинаторика",
        "difficulty": 2,
        "answer_type": "int",
        "correct_answer": "56",
        "hints": ["Используйте число сочетаний."],
    },
    {
        "title": "Решения x+y+z=10",
        "statement": "Сколько троек натуральных чисел (x, y, z) удовлетворяют x + y + z = 10?",
        "subject": "Математика",
        "topic": "Комбинаторика",
        "difficulty": 5,
        "answer_type": "int",
        "correct_answer": "36",
        "hints": ["Метод звёзд и перегородок для натуральных чисел."],
    },
    {
        "title": "Шахматная доска и домино",
        "statement": "Можно ли замостить доску 8x8 без двух противоположных углов домино 1x2? Ответ: Да или Нет.",
        "subject": "Математика",
        "topic": "Инварианты",
        "difficulty": 4,
        "answer_type": "text",
        "correct_answer": "Нет",
        "hints": ["Подумайте о раскраске клеток в два цвета."],
    },
    {
        "title": "Простые числа до 30",
        "statement": "Сколько простых чисел меньше 30?",
        "subject": "Математика",
        "topic": "Теория чисел",
        "difficulty": 2,
        "answer_type": "int",
        "correct_answer": "10",
        "hints": ["Перечислите простые числа по порядку."],
    },
    {
        "title": "НОД(252,198)",
        "statement": "Найдите НОД чисел 252 и 198.",
        "subject": "Математика",
        "topic": "Теория чисел",
        "difficulty": 3,
        "answer_type": "int",
        "correct_answer": "18",
        "hints": ["Используйте алгоритм Евклида."],
    },
    {
        "title": "Сумма углов 12-угольника",
        "statement": "Найдите сумму внутренних углов выпуклого 12-угольника в градусах.",
        "subject": "Математика",
        "topic": "Геометрия",
        "difficulty": 2,
        "answer_type": "int",
        "correct_answer": "1800",
        "hints": ["Формула (n - 2) * 180."],
    },
    {
        "title": "Пути в сетке 2x2",
        "statement": "Сколько кратчайших путей из левого верхнего угла в правый нижний у решётки 2x2 (ходы только вправо и вниз)?",
        "subject": "Математика",
        "topic": "Комбинаторика",
        "difficulty": 3,
        "answer_type": "int",
        "correct_answer": "6",
        "hints": ["Нужно выбрать позиции двух шагов вниз среди четырёх шагов."],
    },
    {
        "title": "Двоичная запись 45",
        "statement": "Запишите число 45 в двоичной системе (без префикса).",
        "subject": "Информатика",
        "topic": "Системы счисления",
        "difficulty": 2,
        "answer_type": "text",
        "correct_answer": "101101",
        "hints": ["45 = 32 + 8 + 4 + 1."],
    },
    {
        "title": "157(8) в десятичной",
        "statement": "Переведите число 157 из восьмеричной системы в десятичную.",
        "subject": "Информатика",
        "topic": "Системы счисления",
        "difficulty": 2,
        "answer_type": "int",
        "correct_answer": "111",
        "hints": ["1*64 + 5*8 + 7."],
    },
    {
        "title": "Единицы в двоичной записи 1023",
        "statement": "Сколько единиц в двоичной записи числа 1023?",
        "subject": "Информатика",
        "topic": "Битовые операции",
        "difficulty": 2,
        "answer_type": "int",
        "correct_answer": "10",
        "hints": ["1023 = 2^10 - 1."],
    },
    {
        "title": "Минимальное n для 2^n > 1000",
        "statement": "Найдите минимальное целое n, для которого 2^n > 1000.",
        "subject": "Математика",
        "topic": "Степени",
        "difficulty": 2,
        "answer_type": "int",
        "correct_answer": "10",
        "hints": ["Сравните 2^9 и 2^10."],
    },
    {
        "title": "Сумма 1+2+4+...+512",
        "statement": "Найдите сумму геометрической прогрессии: 1 + 2 + 4 + ... + 512.",
        "subject": "Математика",
        "topic": "Последовательности",
        "difficulty": 2,
        "answer_type": "int",
        "correct_answer": "1023",
        "hints": ["Это сумма степеней двойки от 2^0 до 2^9."],
    },
    {
        "title": "Вероятность орла",
        "statement": "Честную монету бросают один раз. Какова вероятность выпадения орла? Введите десятичное число.",
        "subject": "Математика",
        "topic": "Вероятность",
        "difficulty": 1,
        "answer_type": "float",
        "correct_answer": "0.5",
        "hints": ["Равновероятны два исхода."],
    },
    {
        "title": "Перестановки из 5 элементов",
        "statement": "Сколькими способами можно расставить 5 различных учеников в один ряд?",
        "subject": "Математика",
        "topic": "Комбинаторика",
        "difficulty": 2,
        "answer_type": "int",
        "correct_answer": "120",
        "hints": ["Это 5!."],
    },
    {
        "title": "Минимальное число с суммой цифр 25",
        "statement": "Найдите наименьшее натуральное число, сумма цифр которого равна 25.",
        "subject": "Математика",
        "topic": "Теория чисел",
        "difficulty": 5,
        "answer_type": "int",
        "correct_answer": "799",
        "hints": ["Чтобы число было минимальным, большие цифры сдвигайте вправо."],
    },
    {
        "title": "Количество делителей 360",
        "statement": "Сколько положительных делителей у числа 360?",
        "subject": "Математика",
        "topic": "Теория чисел",
        "difficulty": 4,
        "answer_type": "int",
        "correct_answer": "24",
        "hints": ["Разложите число на простые множители."],
    },
    {
        "title": "Сумма квадратов от 1 до 10",
        "statement": "Найдите сумму 1^2 + 2^2 + ... + 10^2.",
        "subject": "Математика",
        "topic": "Последовательности",
        "difficulty": 3,
        "answer_type": "int",
        "correct_answer": "385",
        "hints": ["Можно использовать формулу суммы квадратов."],
    },
    {
        "title": "Сумма корней квадратного уравнения",
        "statement": "Для уравнения x^2 - 5x + 6 = 0 найдите сумму корней.",
        "subject": "Математика",
        "topic": "Алгебра",
        "difficulty": 1,
        "answer_type": "int",
        "correct_answer": "5",
        "hints": ["Используйте теорему Виета."],
    },
    {
        "title": "Число рёбер в K9",
        "statement": "Сколько рёбер у полного графа K9?",
        "subject": "Информатика",
        "topic": "Графы",
        "difficulty": 3,
        "answer_type": "int",
        "correct_answer": "36",
        "hints": ["Для полного графа K_n число рёбер равно n(n-1)/2."],
    },
    {
        "title": "Сложность бинарного поиска",
        "statement": "Укажите асимптотику бинарного поиска в отсортированном массиве.",
        "subject": "Информатика",
        "topic": "Алгоритмы",
        "difficulty": 2,
        "answer_type": "text",
        "correct_answer": "O(log n)",
        "hints": ["На каждом шаге диапазон уменьшается в 2 раза."],
    },
    {
        "title": "Сложность сортировки слиянием",
        "statement": "Укажите асимптотику сортировки слиянием.",
        "subject": "Информатика",
        "topic": "Алгоритмы",
        "difficulty": 2,
        "answer_type": "text",
        "correct_answer": "O(n log n)",
        "hints": ["Деление пополам и линейное слияние."],
    },
    {
        "title": "Вершины полного бинарного дерева",
        "statement": "Сколько вершин у полного двоичного дерева высоты 4, если корень на уровне 0?",
        "subject": "Информатика",
        "topic": "Структуры данных",
        "difficulty": 3,
        "answer_type": "int",
        "correct_answer": "31",
        "hints": ["На уровнях 0..4 суммируются степени двойки."],
    },
    {
        "title": "Остаток 2025 по модулю 9",
        "statement": "Найдите остаток от деления 2025 на 9.",
        "subject": "Математика",
        "topic": "Теория чисел",
        "difficulty": 1,
        "answer_type": "int",
        "correct_answer": "0",
        "hints": ["Проверка через сумму цифр."],
    },
    {
        "title": "Двузначные кратные трём",
        "statement": "Сколько двузначных чисел делится на 3?",
        "subject": "Математика",
        "topic": "Арифметика",
        "difficulty": 2,
        "answer_type": "int",
        "correct_answer": "30",
        "hints": ["Посчитайте кратные 3 в диапазоне 10..99."],
    },
    {
        "title": "Количество подмножеств",
        "statement": "Сколько подмножеств у множества из 7 элементов?",
        "subject": "Математика",
        "topic": "Комбинаторика",
        "difficulty": 1,
        "answer_type": "int",
        "correct_answer": "128",
        "hints": ["У каждого элемента два состояния: взять или не взять."],
    },
    {
        "title": "Перестановки букв слова КОД",
        "statement": "Сколько различных перестановок можно составить из букв слова КОД?",
        "subject": "Информатика",
        "topic": "Комбинаторика",
        "difficulty": 1,
        "answer_type": "int",
        "correct_answer": "6",
        "hints": ["Все буквы различны."],
    },
    {
        "title": "Количество игр в круговом турнире",
        "statement": "В турнире участвуют 12 команд, каждая играет с каждой один раз. Сколько всего игр?",
        "subject": "Математика",
        "topic": "Комбинаторика",
        "difficulty": 2,
        "answer_type": "int",
        "correct_answer": "66",
        "hints": ["Каждая игра задаётся парой команд."],
    },
]


def _task_key(item: Dict[str, Any]) -> Tuple[str, str]:
    return str(item["title"]).strip(), str(item["subject"]).strip()


def main() -> None:
    with SessionLocal() as db:
        existing = set(db.execute(select(Task.title, Task.subject)).all())
        inserted = 0

        for item in TASKS:
            key = _task_key(item)
            if key in existing:
                continue
            db.add(Task(**item))
            existing.add(key)
            inserted += 1

        db.commit()
        total = db.scalar(select(func.count(Task.id))) or 0
        print(f"tasks inserted: {inserted}")
        print(f"tasks total: {total}")


if __name__ == "__main__":
    main()
